tests/fixtures/soap/with-descendant-namespaces-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <tns:GetUser xmlns:tns="https://example.com">
            <tns:Id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xsi:type="xsd:int">1</tns:Id>
        </tns:GetUser>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
